import React from "react";
import { View, Text, Image } from "react-native";
import { styles } from "./HelpWithThings.styled";

const HelpWithThings = () => {
  return (
    <View style={styles.section}>
      <View style={styles.container}>
        <Text style={styles.title}>Допомогти речами</Text>
        <Text style={styles.subtitle}>
          Як ваші пожертви можуть полегшити життя безпритульних тварин?
        </Text>
        <Text style={styles.firstText}>
          Ваші дії можуть мати велике значення для безпритульних тварин, навіть
          якщо ви не можете прийняти участь у волонтерській роботі особисто.
          Допомогти речами - це простий і ефективний спосіб підтримати тих, хто
          знаходиться в складній життєвій ситуації. Від збору корму та
          медикаментів до пожертвування необхідних матеріалів для утримання та
          лікування тварин - ваш внесок може зробити справжню різницю. Навіть
          невеликі пожертви можуть мати велике значення, тому що кожен предмет
          або матеріальна допомога додається до загального зусилля забезпечити
          тваринам необхідні умови і допомогти їм знайти новий дім. Приєднуйтесь
          до нас у цьому благородному завданні і допоможіть створити краще
          майбутнє для безпритульних тварин!
        </Text>
        <Text style={styles.text}>
          Допомогу можна відправити Новою поштою: м. Харків, відділення НП №33,
          +38 (066) 345 67 89, Іванов Іван Іванович.
        </Text>
        <Image
          source={require("../../assets/images/help-things.png")}
          style={styles.image}
        />
      </View>
    </View>
  );
};
export default HelpWithThings;
